import { createStore } from "vuex" 

const store = createStore({
  state: {
    menu: [
      {
        name: "Услуги",
        url: "#"
      },
      {
        name: "Почему мы?",
        url: "#"
      },
      {
        name: "Информация",
        url: "#"
      },
      {
        name: "Контакты",
        url: "#"
      },
    ],
    title: "Независимая </br> судебная экспертиза",
    uslugi: {
      title: "Наши услуги",
      sub_title: "Наша компания проводит следующие виды судебной экспертизы:",
      items: [
        {
          title: "Подчерковедческая",
          subtitle: "Точная идентификация человека по его подчерку"
        },
        {
          title: "Автотехническая",
          subtitle: "Выявление дефектов и ущерба авто после дтп"
        },
        {
          title: "Экспертиза документов",
          subtitle: "Экспертиза подлинности документов и их ценности"
        },
        {
          title: "Фоноскопическая",
          subtitle: "Определение принадлежности голоса человеку"
        },
        {
          title: "Строительная",
          subtitle: "Оценка стоимости ремонта, после залива и пожара"
        },
        {
          title: "Лингвистическая",
          subtitle: "Выявление принадлежности словесных конструкций"
        }
      ]
    }
  },
  mutations: {

  },
  actions: {

  },
  getters: {
      
  }
})

export default store
